// Math.clz32 (count leading zero bits in 32-bit binary representations of a number)
// 以 32 位元的二進制表示一個數值的前導零位
Math.clz32(0) // <- 32，00000000000000000000000000000000
Math.clz32(1) // <- 31，00000000000000000000000000000001
Math.clz32(1 << 1) // <- 30，00000000000000000000000000000010
Math.clz32(1 << 2) // <- 29，00000000000000000000000000000100
Math.clz32(1 << 29) // <- 2，00100000000000000000000000000000
Math.clz32(1 << 31) // <- 0，10000000000000000000000000000000


// Math.imul(x, y): 回傳類似 C 語言 32 位元乘法的結果
// Math.fround(value): 將 value 四捨五入至最接近的 32 位元浮點數
